app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls" ORDER BY "urls"."id" DESC LIMIT $1  [["LIMIT", 10]]
---
  def index
    # recent 10 short urls
    @url = Url.new
    @urls = Url.last(10)

INSERT INTO "urls" ("created_at", "updated_at", "short_url", "original_url") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT 1 AS one FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "XDALV"], ["LIMIT", 1]]
---
  def create
    data = params[:url]
    @url = Url.new
    @url.original_url = data[:original_url]
    @url.short_url = @url.generate_url
    if @url.valid?
      @url.save
      redirect_to '/', notice: "URL has successfully been added!" and return
    else
      if !@url.errors[:original_url].empty?

SELECT "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "GDMKQ"], ["LIMIT", 1]]
SELECT "clicks"."created_at" FROM "clicks" WHERE "clicks"."url_id" = $1  [["url_id", 33]]
SELECT "clicks"."browser" FROM "clicks" WHERE "clicks"."url_id" = $1  [["url_id", 33]]
SELECT "clicks"."platform" FROM "clicks" WHERE "clicks"."url_id" = $1  [["url_id", 33]]
---
  def show
    @url = Url.find_by_short_url(params[:url])
    # implement queries
    if @url.present?
      clicks = Click.all.where(url_id: @url.id).pluck(:created_at)
      @daily_clicks = @url.get_dates(clicks)
      browsers = Click.all.where(url_id: @url.id).pluck(:browser)
      @browsers_clicks = @url.get_list(browsers)
      platform = Click.all.where(url_id: @url.id).pluck(:platform)

SELECT "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "adsad"], ["LIMIT", 1]]
SELECT "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "UNVZQ"], ["LIMIT", 1]]
SELECT 1 AS one FROM "urls" WHERE "urls"."short_url" = $1 AND "urls"."id" != $2 LIMIT $3  [["short_url", "RJFZM"], ["id", 33], ["LIMIT", 1]]
UPDATE "urls" SET "clicks_count" = $1, "updated_at" = $2 WHERE "urls"."id" = $3  [["clicks_count", 1], ["updated_at", "2022-06-10 19:51:26.994336"], ["id", 33]]
INSERT INTO "clicks" ("created_at", "updated_at", "url_id", "browser", "platform") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-06-10 19:51:27.045297"], ["updated_at", "2022-06-10 19:51:27.045297"], ["url_id", 33], ["browser", "Firefox"], ["platform", "Generic Linux"]]
---
  def visit
    @url = Url.find_by_short_url(params[:short_url])
    if @url.present?
      @url.update_attributes(clicks_count: @url.clicks_count+1)
      Click.create(browser: browser.name, platform: browser.platform.name, url_id: @url.id)